hakoren/app/Http/DataUtil/ServerPath.php

    public static function getPricebasic($class_id, $origin_day ,$prev_day, $current_day) {
        $price = 0;

        $current_night  = (int)$current_day['night'];
        $current_day    = (int)$current_day['day'];
        $origin_night   = (int)$origin_day[0];
        $origin_day     = (int)$origin_day[1];
        $prices = \DB::table('car_class_price')
            ->where('class_id',$class_id)->first();
---
select * from `car_class_price` where `class_id` = '3' limit 1

    public static function getPriceFromClass($start_date, $end_date, $class_id, $selected_day, $origin_start, $origin_end)
{
    $price  = 0;
    $night_day = explode("_",$selected_day);
    $night  = (int)$night_day[0];
    $day    = (int)$night_day[1];
    //get from custom price
//        $prices = \DB::table('car_class_price_custom')
//            ->where('class_id',$class_id)
//            ->where('startdate',$start_date)->first();
    $prices = \DB::table('car_class_price_custom')
        ->where('class_id',$class_id)
        ->where(function ($query) use($start_date ,$end_date) {
            $query->where(function ($query1) use($start_date ,$end_date) {
                $query1->wheredate('startdate', '<=', $start_date)
                    ->wheredate('enddate', '>=', $end_date);
            })->orwhere(function ($query1) use($start_date,$end_date) {
                $query1->wheredate('startdate', '>=', $start_date)
                    ->wheredate('startdate', '<=', $end_date)
                    ->wheredate('enddate', '>=', $end_date);
            })->orwhere(function ($query1) use($start_date,$end_date) {
                $query1->wheredate('startdate', '<=', $start_date)
                    ->wheredate('enddate', '>=', $start_date)
                    ->wheredate('enddate', '<=', $end_date);
            })->orwhere(function ($query1) use($start_date,$end_date) {
                $query1->wheredate('startdate', '>=', $start_date)
                    ->wheredate('enddate', '<=', $end_date);
            });
        })->orderby('startdate' ,'asc')
        ->first();
---
select * from `car_class_price_custom` where `class_id` = '3' and ((date(`startdate`) <= '2018/12/8' and date(`enddate`) >= '2018/12/08') or (date(`startdate`) >= '2018/12/8' and date(`startdate`) <= '2018/12/08' and date(`enddate`) >= '2018/12/08') or (date(`startdate`) <= '2018/12/8' and date(`enddate`) >= '2018/12/8' and date(`enddate`) <= '2018/12/08') or (date(`startdate`) >= '2018/12/8' and date(`enddate`) <= '2018/12/08')) order by `startdate` asc limit 1

    public static function getInsurancePrice2($class_id)
    {
        $prices = \DB::table('car_class_insurance')
            ->select(['insurance_id', 'price'])
            ->where('class_id', $class_id)
            ->get();
---
select `insurance_id`, `price` from `car_class_insurance` where `class_id` = '3'

    public static function getClassMaxPassengers($class_id, $shop_id) {
        $cars = \DB::table('car_class_model as cm')
            ->leftJoin('car_model as m', 'm.id', '=', 'cm.model_id' )
            ->leftJoin('car_type as ct', 'm.type_id', '=', 'ct.id')
            ->leftJoin('car_inventory as ci', 'cm.model_id', '=', 'ci.model_id')
            ->select('ci.max_passenger')
            ->where('cm.class_id', '=', $class_id)
            ->where('ci.delete_flag', 0)
            ->where('ci.status', 1)
            ->where('ci.shop_id',$shop_id)
            ->whereNotNull('ci.max_passenger')
            ->groupBy('ci.max_passenger')
            ->orderBy('ci.max_passenger')
            ->get();
---
select `ci`.`max_passenger` from `car_class_model` as `cm` left join `car_model` as `m` on `m`.`id` = `cm`.`model_id` left join `car_type` as `ct` on `m`.`type_id` = `ct`.`id` left join `car_inventory` as `ci` on `cm`.`model_id` = `ci`.`model_id` where `cm`.`class_id` = '3' and `ci`.`delete_flag` = '0' and `ci`.`status` = '1' and `ci`.`shop_id` = '4' and `ci`.`max_passenger` is not null group by `ci`.`max_passenger` order by `ci`.`max_passenger` asc

    public static function getClassAvailableMaxPassengers($class_id, $shop_id, $start, $end) {
        $max_passengers = self::getClassMaxPassengers($class_id, $shop_id);
        $tmp = [];
        foreach ($max_passengers as $key => $mp) {
            $cars = \DB::table('car_class_model as cm')
                ->leftJoin('car_model as m', 'm.id', '=', 'cm.model_id' )
                ->leftJoin('car_type as ct', 'm.type_id', '=', 'ct.id')
                ->leftJoin('car_inventory as ci', 'cm.model_id', '=', 'ci.model_id')
                ->select('ci.*')
                ->where('cm.class_id', '=', $class_id)
                ->where('ci.delete_flag', 0)
                ->where('ci.status', 1)
                ->where('ci.shop_id',$shop_id)
                ->where('ci.max_passenger', $mp->max_passenger)
                ->get();
---
select `ci`.* from `car_class_model` as `cm` left join `car_model` as `m` on `m`.`id` = `cm`.`model_id` left join `car_type` as `ct` on `m`.`type_id` = `ct`.`id` left join `car_inventory` as `ci` on `cm`.`model_id` = `ci`.`model_id` where `cm`.`class_id` = '3' and `ci`.`delete_flag` = '0' and `ci`.`status` = '1' and `ci`.`shop_id` = '4' and `ci`.`max_passenger` = '7'