hakoren/app/Http/Controllers/CarClassController.php

select * from `car_shop`
select * from `admin_shop` where `admin_id` = '1' limit 1
select * from `car_class` where `car_shop_name` = '4' order by `car_class_priority` asc
select * from `car_class_model` where `class_id` = '67' order by `priority` asc
select * from `car_type_category`
---
    public function index(Request $request)
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $shops      = Shop::all();

        if($request->has('car_shop')){
            $shop_id = $request->get('car_shop');
        } else {
            $admin      = Auth::user();
            $related_shop = \DB::table('admin_shop')->where('admin_id', $admin->id)->first();
            if(is_null($related_shop)) {
                $related_shop = Shop::orderBy('id')->first();
            }
            $shop_id = $related_shop->shop_id;
        }

        $classes    = CarClass::where('car_shop_name', $shop_id)
                        ->orderBy('car_class_priority')->get();

        foreach ($classes as $key => $cls) {
            $carClassModel = \DB::table('car_class_model')
                ->where('class_id', $cls->id)
                ->orderBy('priority')->get();
            $classes[$key]->carClassModel = $carClassModel;
        }

        $car_category = \DB::table('car_type_category')->get();

select * from `car_model`
select * from `car_passenger_tags`
select `id`, `name`, `slug` from `car_shop`
---
    public function create()
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        //$models      = CarModel::where('selected_by_class','0')->get(); changed logic from this
        $models      = CarModel::all();
        $passengertags      = CarPassengerTags::all();
		$shop_list   = \DB::table('car_shop')->select('id','name','slug')->get();

select * from `car_class` where `car_class`.`id` = '3' limit 1
select * from `car_class_thumb` where `class_id` = '3'
select * from `car_model`
select `c`.* from `car_class_suggests` as `s` left join `car_class` as `c` on `s`.`suggest_class_id` = `c`.`id` where `s`.`class_id` = '3'
---
    public function show($id, Request $request)
    {
        $carclass = CarClass::find($id);
        $thumbnails = \DB::table('car_class_thumb')->where('class_id',$id)->get();
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $models = \DB::table('car_model')->get();
        $suggests =  \DB::table('car_class_suggests as s')
            ->leftJoin('car_class as c', 's.suggest_class_id', '=', 'c.id')
            ->where('s.class_id', $id)
            ->select('c.*')->get();

select * from `car_class` where `car_class`.`id` = '68' limit 1
select * from `car_model`
select * from `car_option`
select * from `car_insurance`
select * from `car_equip`
select * from `car_passenger_tags`
select * from `car_class_price` where `class_id` = '68' limit 1
select * from `car_class_thumb` where `class_id` = '68'
select * from `car_class`
select * from `car_class_suggests` where `class_id` = '68'
select * from `car_class_insurance` where `class_id` = '68' and `insurance_id` = '1' limit 1
---
    public function edit($id)
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $carclass   = CarClass::findOrFail($id);
        $models     = CarModel::all();
        $options    = CarOption::all();
        $inses      = CarInsurance::all();
        $equipments = CarEquip::all();
        $passengertags  = CarPassengerTags::all();
        $normal     =  DB::table('car_class_price')->where('class_id',$id)->first();
        $thumbnails = \DB::table('car_class_thumb')->where('class_id',$id)->get();
        $classes = CarClass::all();

        foreach ($classes as $key=>$cls) {
            if($cls->id == $id) unset($classes[$key]);
        }

        $suggest_classes = DB::table('car_class_suggests')->where('class_id',$id)->get();

        $insurances = array();
        foreach($inses as $in){
            $price = 0;
            $obj = clone $in;
            $carins     = DB::table('car_class_insurance')
                ->where('class_id',$id)->where('insurance_id',$in->id)->first();

select * from `car_class_price_custom` where `class_id` = '68'
select `c`.`class_id`, `c`.`model_id`, `m`.`name`, `c`.`priority` from `car_class_model` as `c` left join `car_model` as `m` on `c`.`model_id` = `m`.`id` where `c`.`class_id` = '68' order by `c`.`priority` asc
select `id`, `name`, `slug` from `car_shop`
---
            $normal['additional_total'] = '0';
        }

        $customs    =  DB::table('car_class_price_custom')
            ->where('class_id',$id)->get();

        $pOrders = \DB::table('car_class_model as c')
            ->leftJoin('car_model as m', 'c.model_id','=','m.id')
            ->where('c.class_id', $id)
            ->select('c.class_id', 'c.model_id', 'm.name', 'c.priority')
            ->orderBy('c.priority')
            ->get();

        $shop_list = \DB::table('car_shop')->select('id','name','slug')->get();

select * from `car_class_price_custom` where `class_id` = '4'
---
	public function fetchCarClassCustomData(Request $request){

		 if($request->ajax()){

			$perpage	= 20;
        	$customs    =  DB::table('car_class_price_custom')
            				 ->where('class_id',$request->get('car_class_id'))->get();

select * from `car_model` where `id` = '57' limit 1
---
    public function getCarModelName($id) {
        $model     = \DB::table('car_model')->where('id',$id)->first();

select `cm`.*, `ct`.`name` as `type_name`, `cv`.`name` as `vendor_name` from `car_model` as `cm` inner join `car_type` as `ct` on `ct`.`id` = `cm`.`type_id` inner join `car_vendor` as `cv` on `cv`.`id` = `cm`.`vendor_id` where `cm`.`id` = '9' limit 1
select * from `car_shop`
select count(*) as aggregate from `car_inventory` as `ci` where `shop_id` = '4' and `status` = '1'
select count(*) as aggregate from `car_inventory` as `ci` where `shop_id` = '4' and `status` = '0'
---
    public function getCarModelInform($model_id) {
        /* car model name
        - car model thumbnail
        - car type
        - car vendor
        - car number (active: 0 cars / inactive 0 cars)
        - relating shops
        eg: Shop A ( active 10 cars / inactive 2 cars )  from car inventory
        */
        $model     = \DB::table('car_model as cm')
                        ->join('car_type as ct', 'ct.id', '=', 'cm.type_id')
                        ->join('car_vendor as cv', 'cv.id', '=', 'cm.vendor_id')
                        ->select(['cm.*' ,'ct.name as type_name','cv.name as vendor_name'])
                        ->where('cm.id' , $model_id)
                        ->first();

        $shops  = Shop::all();
        $car    = array();
        foreach($shops as $shop) {
            $carinvne_active = \DB::table('car_inventory as ci')
                            ->where('shop_id', $shop->id)
                            ->where('status', '1')
                            ->count();
            $carinvne_inactive = \DB::table('car_inventory as ci')
                ->where('shop_id', $shop->id)
                ->where('status', '0')
                ->count();