hakoren/app/Http/Controllers/CarEquipController.php

select `equip`.* from `car_equip` as `equip` order by `equip`.`id` desc
---
    public function index(Request $request)
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $equips = \DB::table('car_equip as equip')
            ->select(['equip.*']);

        $equips = $equips
            ->orderby('equip.id', 'desc')->get();