hakoren/app/Http/Controllers/CarInsuranceController.php

select `insurance`.* from `car_insurance` as `insurance` order by `insurance`.`id` desc
---
    public function index(Request $request)
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $insurances = \DB::table('car_insurance as insurance')
            ->select(['insurance.*']);

        $insurances = $insurances
            ->orderby('insurance.id', 'desc')->get();