hakoren/app/Http/Controllers/CarModelController.php

select * from `car_model`
---
    public function index(Request $request)
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $models     = CarModel::all();

select * from `car_model` where `car_model`.`id` = '54' limit 1
select * from `car_type`
select * from `car_vendor`
select * from `car_equip`
select * from `car_model_thumb` where `model_id` = '54'
select * from `car_type_category`
---
    public function edit($id)
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $carmodel   = CarModel::findOrFail($id);
        $types      = CarType::all();
        $vendors    = CarVendor::all();
        $equips     = CarEquip::all();
        $thumbnails = \DB::table('car_model_thumb')->where('model_id',$id)->get();
        $category   = \DB::table('car_type_category')->get();

select count(*) as aggregate from `car_inventory` where `model_id` = '54' and `smoke` = '1' and `delete_flag` = '0'
---
    public function getnumberSmoking($model_id, $cond) {
        //$cond == 1 -> smoke  $cond == 0 -> non smoke
        $smokenum = \DB::table('car_inventory')
            ->where('model_id', $model_id)
            ->where('smoke', $cond)
            ->where('delete_flag', 0)
            ->count();

select * from `car_type` where `category_id` = '1'
---
    public function getcartype(Request $request) {
        $category_id = $request->get('category_id');
        $type = \DB::table('car_type')->where('category_id', $category_id)->get();