hakoren/app/Http/Controllers/CarOptionController.php

select * from `car_option`
select * from `car_class`
select * from `car_shop`
---
    public function index(Request $request)
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $options    = CarOption::all();
        $classes    = \DB::table('car_class')->get();
        $shops      = \DB::table('car_shop')->get();

select * from `car_shop` where `id` = '4' limit 1
---
    public function getCarShopName($id) {
        $shop     = \DB::table('car_shop')->where('id',$id)->first();

select * from `car_class` where `id` = '1' limit 1
---
    public function getCarClassName($id) {
        $class     = \DB::table('car_class')->where('id',$id)->first();