hakoren/app/Http/Controllers/CarPassengerController.php

    public function index(Request $request)
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $passengers = CarPassengerTags::all();
---
select * from `car_passenger_tags`