hakoren/app/Http/Controllers/CarTypeController.php

    public function index(Request $request)
    {
        $route      = ServerPath::getRoute();
        $subroute   = ServerPath::getSubRoute();
        $types = \DB::table('car_type as type')
            ->leftjoin('car_type_category as ca','ca.id','=','type.category_id')
            ->select(['type.*','ca.name as category_name']);

        $types = $types
            ->orderby('type.id', 'desc')->get();
---
select `type`.*, `ca`.`name` as `category_name` from `car_type` as `type` left join `car_type_category` as `ca` on `ca`.`id` = `type`.`category_id` order by `type`.`id` desc

    public function show($id, Request $request)
    {

//        $cartype = CarType::find($id);
        $cartype =  \DB::table('car_type as ct')
                    ->leftjoin('car_type_category as ca','ca.id','=','ct.category_id')
                    ->where('ct.id',$id)
                    ->select(['ct.*','ca.name as category_name'])->first();
---
select `ct`.*, `ca`.`name` as `category_name` from `car_type` as `ct` left join `car_type_category` as `ca` on `ca`.`id` = `ct`.`category_id` where `ct`.`id` = '12' limit 1