hakoren/app/Http/Controllers/DashBoardController.php

select * from `car_shop`
select * from `admin_shop` where `admin_id` = '1' limit 1
select * from `car_shop` where `id` = '4' limit 1
---
    public function admintop(Request $request)
    {
        $route          = ServerPath::getRoute();
        $subroute       = ServerPath::getSubRoute();
        $user = Auth::user();
        $current_date = date("Y-m-d");
        $shops = Shop::all();
        $shop_id = '0';
        $related_shop = \DB::table('admin_shop')->where('admin_id', $user->id)->first();
        $user_shop_id = 0;
        if(!empty($related_shop))
            $user_shop_id = $related_shop->shop_id;
        if($request->has('shop_id')) {
            $shop_id = intval($request->input('shop_id'));
        }else {
            $shop_id = $user_shop_id;
        }
        $shop_kind = 'both';
        $shopname = \DB::table('car_shop')->where('id',$shop_id)->first();

select count(*) as paid_count from `bookings` where `status` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10') and `pickup_id` = '4' and `created_at` LIKE '%2018-12-01%' limit 1
---
    public function gettemporalamount($date ,  $shop_id) {
        $price = 0;
        $statuses = array("1", "2", "3","4","5","6","7","8","9","10");
        $bookings = \DB::table('bookings')
            ->whereIn('status',$statuses);
        if ($shop_id != 0)
            $bookings = $bookings->where('pickup_id', '=', $shop_id);

        $bookings = $bookings->where('created_at', 'LIKE', '%' . $date . '%')
            ->select(DB::raw('count(*) as paid_count'))->first();

select count(*) as paid_count from `bookings` where `status` in ('9') and `pickup_id` = '4' and `canceled_at` LIKE '%2018-12-01%' limit 1
---
    public function getcancelamount($date ,  $shop_id) {
        $price = 0;
        $statuses = array("9");
        $bookings = \DB::table('bookings')
            ->whereIn('status',$statuses);
        if ($shop_id != 0)
            $bookings = $bookings->where('pickup_id', '=', $shop_id);

        $bookings = $bookings->where('canceled_at', 'LIKE', '%' . $date . '%')
            ->select(DB::raw('count(*) as paid_count'))->first();

select count(*) as aggregate from `bookings` where `status` in ('1', '2', '3', '4', '5', '6', '7', '8', '10') and `pickup_id` = '4' and ((`returning` LIKE '%2018-12-08%' and `returning_updated` = '0000-01-01 00:00:00') or (date(`returning_updated`) LIKE '%2018-12-08%'))
---
    public function getdepartreturncount($date ,$cond, $shop_id) {
        $count = 0;
        $statuses = array("1", "2", "3","4","5","6","7","8","10");
        $bookings = \DB::table('bookings')
            ->whereIn('status',$statuses);
        if($shop_id != 0)
            $bookings = $bookings->where('pickup_id','=', $shop_id);
        if($cond == 'depart') {
            $bookings = $bookings->where('departing','LIKE', '%'.$date.'%');
        }
        if($cond == 'return') {
            $bookings = $bookings->where(function ($query) use($date) {
                                    $query->where(function ($query2) use ($date) {
                                        $query2->where('returning', 'LIKE', '%'.$date.'%')
                                            ->where('returning_updated', '0000-01-01 00:00:00');
                                    })->orwhere(function ($query1) use ($date) {
                                        $query1->whereDate('returning_updated', 'LIKE', '%'.$date.'%');
                                    });
            });
        }
//        $bookings = $bookings->select(DB::raw('count(*) as booking_count')) -> first();
//        $count = $bookings->booking_count;
        $count = $bookings->count();

select i.status, i.shortname, i.id as inventory_id,i.smoke,CONCAT_WS(i.numberplate3, i.numberplate4) as numberplate,cm.name as modelname,ccm.class_id as class_id,cc.car_shop_name from `car_inventory` as `i` left join `car_class_model` as `ccm` on `ccm`.`model_id` = `i`.`model_id` left join `car_class` as `cc` on `cc`.`id` = `ccm`.`class_id` left join `car_model` as `cm` on `cm`.`id` = `i`.`model_id` where `i`.`shop_id` = '4' and `cc`.`car_shop_name` = '4' and `i`.`delete_flag` = '0' order by `cc`.`car_class_priority` asc, `ccm`.`priority` asc, `i`.`smoke` desc, `i`.`priority` asc
---
    public function getusedcarmonth($date , $shop_id) {
        $curent_month = date('Y-m-d', strtotime($date));
        $first = date('Y-m-01', strtotime($curent_month));
        $last = date('Y-m-t', strtotime($curent_month));
        $daysInMonth = (int)date('t', strtotime($first));
        $used_car_indices = [];
        $count_active_cars  = 0;
        $count_booked_dates  = 0;
        $count_inspect_dates = 0;
        $count_subst1_dates  = 0;
        $count_subst2_dates  = 0;

        $carnames   = \DB::table('car_inventory as i')
            ->leftjoin('car_class_model as ccm','ccm.model_id','=', 'i.model_id')
            ->leftjoin('car_class as cc','cc.id','=', 'ccm.class_id')
            ->leftjoin('car_model as cm' ,'cm.id','=','i.model_id')
            ->select(\DB::raw("i.status, i.shortname, i.id as inventory_id,i.smoke,CONCAT_WS(i.numberplate3, i.numberplate4) as numberplate,cm.name as modelname,ccm.class_id as class_id,cc.car_shop_name"));
        if($shop_id != 0)
                $carnames   = $carnames->where('i.shop_id',$shop_id)
                                        ->where('cc.car_shop_name', $shop_id );
        $carnames   = $carnames
            ->where('i.delete_flag', 0)
            ->orderBy('cc.car_class_priority')
            ->orderBy('ccm.priority')
            ->orderBy('i.smoke', 'desc')
            ->orderBy('i.priority')
            ->get();

select `b`.*, `ps`.`name` as `portal_name`, `bs`.`name` as `booking_status` from `bookings` as `b` left join `portal_site` as `ps` on `ps`.`id` = `b`.`portal_id` left join `booking_status` as `bs` on `bs`.`status` = `b`.`status` where `b`.`inventory_id` = '50' and date(`b`.`departing`) <= '2018-12-31' and date(`b`.`returning`) >= '2018-12-01' and `b`.`status` in ('1', '2', '3', '4', '5', '6', '7', '10') order by `b`.`id` asc
---
            if ($car->status == 1) $count_active_cars++;
            $statuses = [1, 2, 3, 4, 5, 6, 7, 10];

            $used_bookings = \DB::table('bookings as b')
                ->leftjoin('portal_site as ps','ps.id','=','b.portal_id')
                ->leftjoin('booking_status as bs','bs.status','=','b.status')
                ->where('b.inventory_id', $car->inventory_id)
                ->whereDate('b.departing', '<=', date('Y-m-d', strtotime($last)))
                ->whereDate('b.returning', '>=', date('Y-m-d', strtotime($first)))
                ->whereIn('b.status',$statuses)
                ->select(['b.*','ps.name as portal_name','bs.name as booking_status'])
                ->orderBy('b.id')->get();

select * from `car_inspections` where `inventory_id` = '50' and `delete_flag` = '0' and `status` < '3' order by `id` desc
---
                $count_booked_dates += $days;
            }
            //inspection
            $inspections = \DB::table('car_inspections')
                ->where('inventory_id', $car_id)
                ->where('delete_flag', '=', 0)
                ->where('status', '<', 3)
                ->orderBy('id', 'desc')->get();

select count(*) as aggregate from `bookings` where `portal_id` = '1' and `status` in ('1', '2', '3', '4', '5', '6', '7', '8', '10') and `pickup_id` = '4' and `departing` LIKE '%2018-01%'
---
    public function getportalbookingnumber($date ,$cond, $shop_id, $portal_id) {
        $count = 0;
        $statuses = array("1", "2", "3","4","5","6","7","8","10");
        $bookings = \DB::table('bookings')
            ->where('portal_id', $portal_id)
            ->whereIn('status',$statuses);
        if($shop_id != 0)
            $bookings = $bookings->where('pickup_id','=', $shop_id);
        if($cond == 'depart') {
            $bookings = $bookings
                ->where('departing','LIKE', '%'.$date.'%');
        }
//        $bookings = $bookings->select(DB::raw('count(*) as booking_count')) -> first();
//        $count = $bookings->booking_count;
        $count = $bookings->count();

select * from `car_shop` where `shop_number` = '1' limit 1
select * from `car_shop` where `shop_number` = '2' limit 1
select * from `car_shop` where `shop_number` = '3' limit 1
---
    public function todaySalesMount($current_date,$shop_id) {
        $ret = (object)array();
        $all_sales = $this->getrealsales($current_date,0);
        $all_mount = $this->getrealdepartreturncount($current_date,'depart',0);
        //get fukuoka id;
        $fuku = \DB::table('car_shop')->where('shop_number','1')->first();
        $fuku_id = $fuku->id;
        $fuku_sales = $this->getrealsales($current_date,$fuku_id);
        $fuku_mount = $this->getrealdepartreturncount($current_date,'depart',$fuku_id);
        $fuku_percent = 0;
        if($all_mount != 0) $fuku_percent = round((100/$all_mount)*$fuku_mount);

        $okina = \DB::table('car_shop')->where('shop_number','2')->first();
        $okina_id = $okina->id;
        $okina_sales = $this->getrealsales($current_date,$okina_id);
        $okina_mount = $this->getrealdepartreturncount($current_date,'depart',$okina_id);
        $okina_percent = 0;
        if($all_mount != 0) $okina_percent = round((100/$all_mount)*$okina_mount);

        $kagoshima = \DB::table('car_shop')->where('shop_number','3')->first();

select * from `car_shop` where `shop_number` = '1' limit 1
select * from `car_shop` where `shop_number` = '2' limit 1
select * from `car_shop` where `shop_number` = '3' limit 1
---
    public function todayInsurance($current_date, $shop_id) {
        $ret = (object)array();
        $all_insurance = $this->getSaleInsurance($current_date,0);
        $ret->all_insurance_price = $all_insurance->insurance;
        $ret->all_insurance_mount = $all_insurance->mount;
        //get fukuoka id;
        $fuku = \DB::table('car_shop')->where('shop_number','1')->first();
        $fuku_id = $fuku->id;
        $fuku_insurance = $this->getSaleInsurance($current_date, $fuku_id);
        $ret->fuku_insurance_price = $fuku_insurance->insurance;
        $ret->fuku_insurance_mount = $fuku_insurance->mount;
        //get okina id;
        $okina = \DB::table('car_shop')->where('shop_number','2')->first();
        $okina_id = $okina->id;
        $okina_insurance = $this->getSaleInsurance($current_date, $okina_id);
        $ret->okina_insurance_price = $okina_insurance->insurance;
        $ret->okina_insurance_mount = $okina_insurance->mount;
        //get kagoshima id;
        $kagoshima = \DB::table('car_shop')->where('shop_number','3')->first();

select * from `car_shop` where `shop_number` = '1' limit 1
select * from `car_shop` where `shop_number` = '2' limit 1
select * from `car_shop` where `shop_number` = '3' limit 1
---
    public function todayOption($current_date, $shop_id) {
        $ret = (object)array();
        $all_option = $this->getSaleOption($current_date,0);
        $ret->all_option_price = $all_option->option;
        $ret->all_option_mount = $all_option->mount;
        //get fukuoka id;
        $fuku = \DB::table('car_shop')->where('shop_number','1')->first();
        $fuku_id = $fuku->id;
        $fuku_option = $this->getSaleOption($current_date, $fuku_id);
        $ret->fuku_option_price = $fuku_option->option;
        $ret->fuku_option_mount = $fuku_option->mount;
        //get okina id;
        $okina = \DB::table('car_shop')->where('shop_number','2')->first();
        $okina_id = $okina->id;
        $okina_option = $this->getSaleOption($current_date, $okina_id);
        $ret->okina_option_price = $okina_option->option;
        $ret->okina_option_mount = $okina_option->mount;

        //get kagoshima id;
        $kagoshima = \DB::table('car_shop')->where('shop_number','3')->first();

select * from `car_shop` where `id` = '4' limit 1
---
    public function todayBooking($current_date,$shop_id)
    {
        $bookings = \DB::table('bookings as b')
            ->leftjoin('users as u', 'b.client_id','=','u.id')
            ->leftjoin('booking_status as bs','bs.status','=','b.status')
            ->leftjoin('car_inventory as ci', 'ci.id','=','b.inventory_id')
            ->leftjoin('car_class as cc','cc.id','=','b.class_id')
            ->leftjoin('portal_site as ps','ps.id','=','b.portal_id')
            ->select(['b.*','u.first_name','u.last_name','ps.show_flag','cc.id as class_id','cc.name as class_name',
                'ci.smoke','ps.name as portal_name']) ;

        if($shop_id != 0)
            $bookings = $bookings->where('b.pickup_id','=', $shop_id);
            $bookings = $bookings
                            ->where('b.created_at', 'LIKE', '%' . $current_date . '%')
                            ->orderBy('id', 'desc')
                            //->where('ps.show_flag' ,'1')
                            ->get();
        $ret = array();
        $ret['date'] = date('n/j');
        $shop_name = '';
        if($shop_id != '0') {
            $shop = \DB::table('car_shop')->where('id', $shop_id)->first();

select * from `car_shop` where `id` = '4' limit 1
---
    public function todayPortalBooking($current_date,$shop_id)
    {
        $bookings = \DB::table('bookings as b')
            ->leftjoin('portal_site as ps','ps.id','=','b.portal_id')
            ->select(['b.*','ps.show_flag','ps.name as portal_name']) ;

        if($shop_id != 0)
            $bookings = $bookings->where('b.pickup_id','=', $shop_id);
        $bookings = $bookings
            ->where('b.created_at', 'LIKE', '%' . $current_date . '%')
           // ->where('ps.show_flag' ,'1')
            ->orderBy('id', 'desc')
            ->get();
        $ret = array();
        $ret['date'] = date('n/j');
        $shop_name = '';
        if($shop_id != '0') {
            $shop = \DB::table('car_shop')->where('id', $shop_id)->first();