hakoren/app/Http/Controllers/MemberManagementController.php

    public function index(Request $request)
    {
        $route = Route::getFacadeRoot()->current()->uri();
        $dateinterval = $request->get('dateinterval', '');

        $users = \DB::table('users as u')
            ->join('role_user as r', 'r.user_id', '=', 'u.id')
            ->join('profiles as p', 'p.user_id', '=', 'u.id')
            ->join('roles as ro', 'ro.id', '=', 'r.role_id')
            ->leftJoin('users_category as ca', 'p.category_id', '=', 'ca.id')
            ->leftJoin('credit_card as card', 'p.credit_card_type', '=', 'card.id')
            ->select(['u.*' ,'p.fur_first_name','p.fur_last_name','p.sex','p.birth','p.category_id','p.phone',
                'p.postal_code','p.prefecture','p.city','p.address1','p.address2','p.emergency_phone','p.foreign_address',
                'p.foreign_city','p.foreign_state','p.foreign_country','p.foreign_zip_code','p.company_name',
                'p.company_postal_code','p.company_prefecture','p.company_address1','p.company_address2','p.company_city',
                'p.company_address2','p.credit_card_type','p.credit_card_number','p.credit_card_expiration','p.credit_card_code',
                'ca.alias as user_category','r.role_id','card.name as card_name']);

        if($dateinterval != ''){
            $dates = explode(' - ', $dateinterval);
            $startdate = date('Y-m-d', strtotime($dates[0]));
            $enddate = date('Y-m-d', strtotime($dates[1]));
            $users = $users->where('u.updated_at', '>=', $startdate)->where('u.updated_at', '<=', $enddate);
        }

        $users = $users
            ->where('u.activated', 1)
            ->whereNotNull('u.email')
            ->where('ro.level','1')  //only user
            ->orderby('u.created_at', 'desc')->get();
---
select `u`.*, `p`.`fur_first_name`, `p`.`fur_last_name`, `p`.`sex`, `p`.`birth`, `p`.`category_id`, `p`.`phone`, `p`.`postal_code`, `p`.`prefecture`, `p`.`city`, `p`.`address1`, `p`.`address2`, `p`.`emergency_phone`, `p`.`foreign_address`, `p`.`foreign_city`, `p`.`foreign_state`, `p`.`foreign_country`, `p`.`foreign_zip_code`, `p`.`company_name`, `p`.`company_postal_code`, `p`.`company_prefecture`, `p`.`company_address1`, `p`.`company_address2`, `p`.`company_city`, `p`.`company_address2`, `p`.`credit_card_type`, `p`.`credit_card_number`, `p`.`credit_card_expiration`, `p`.`credit_card_code`, `ca`.`alias` as `user_category`, `r`.`role_id`, `card`.`name` as `card_name` from `users` as `u` inner join `role_user` as `r` on `r`.`user_id` = `u`.`id` inner join `profiles` as `p` on `p`.`user_id` = `u`.`id` inner join `roles` as `ro` on `ro`.`id` = `r`.`role_id` left join `users_category` as `ca` on `p`.`category_id` = `ca`.`id` left join `credit_card` as `card` on `p`.`credit_card_type` = `card`.`id` where `u`.`activated` = '1' and `u`.`email` is not null and `ro`.`level` = '1' order by `u`.`created_at` desc

                    function($join)
                    {
                        $join->on('shops.id', '=', 'pickups.pickup_id');
                    })
                ->get();
            $shoplist = [];
            foreach ($shops as $shop) {
                array_push($shoplist, $shop->name);
            }
            $user->store = implode('<br>', $shoplist);
            $last = \DB::table('bookings')
                ->where('client_id', '=', $uid)
                ->orderBy('created_at', 'desc')->first();
            $user->last_use = is_null($last)? '' : date('Y/m/d', strtotime($last->created_at));
            $user->visit_count = \DB::table('bookings')->where('client_id', '=', $uid)->count();
        }
        //echo json_encode($users); return;
        $roles = Role::all();
        $memberuser = \DB::table('users as u')
                                    ->join('role_user as r', 'r.user_id', '=', 'u.id')
                                    ->join('profiles as p', 'p.user_id', '=', 'u.id')
                                    ->join('roles as ro', 'ro.id', '=', 'r.role_id')
                                    ->whereNotNull('u.email')
                                    ->where('ro.level','1');
        $total_users = clone $memberuser;
        $total_users = $total_users->get();;
        //new user
        $current_month = date('Y-m');
        $new_users = clone $memberuser;
        $new_users = $new_users->where('u.created_at','like', '%'.$current_month.'%')->get();
---
select * from `bookings` where `client_id` = '2259' order by `created_at` desc limit 1
select count(*) as aggregate from `bookings` where `client_id` = '2259'
select * from `roles`
select * from `users` as `u` inner join `role_user` as `r` on `r`.`user_id` = `u`.`id` inner join `profiles` as `p` on `p`.`user_id` = `u`.`id` inner join `roles` as `ro` on `ro`.`id` = `r`.`role_id` where `u`.`email` is not null and `ro`.`level` = '1'
select * from `users` as `u` inner join `role_user` as `r` on `r`.`user_id` = `u`.`id` inner join `profiles` as `p` on `p`.`user_id` = `u`.`id` inner join `roles` as `ro` on `ro`.`id` = `r`.`role_id` where `u`.`email` is not null and `ro`.`level` = '1' and `u`.`created_at` like '%2018-12%'