hakoren/app/Http/Controllers/SalesManagementController.php

select * from `car_shop`
select * from `admin_shop` where `admin_id` = '1' limit 1
---
    public function sales(Request  $request) {
        $admin = Auth::user();
        if(!Auth::check() || !$admin->isAdmin())
            return Redirect::back();
        $route          = ServerPath::getRoute();
        $subroute       = ServerPath::getSubRoute();
        $shops = Shop::all();
        $date = date('Y-m-d');
        $related_shop = \DB::table('admin_shop')->where('admin_id', $admin->id)->first();

select SUM(given_points) as sumpayment from `bookings` where `pay_method` > '0' and `pay_status` = '1' and `status` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10') and `pickup_id` = '4' and `departing` LIKE '%2018-12-07%' and `depart_task` = '1' limit 1
---
    public function getSalesAdjustmentMount($date , $cond , $shop_id) {
        $price = 0;
        $status = array("1","2","3","4","5","6","7","8","9","10");
        $bookings = \DB::table('bookings')
                    ->where('pay_method','>','0')
                    ->where('pay_status','1')
                    ->whereIn('status', $status);
        if($shop_id != 0)
            $bookings = $bookings->where('pickup_id','=', $shop_id);

        $bookings_deaprt    = $bookings->where('departing','LIKE', '%'.$date.'%')
            ->where('depart_task','1')
            ->select(DB::raw("SUM(given_points) as sumpayment"))->first();

select * from `bookings` where `status` = '9' and `pickup_id` = '4' and `cancel_date` LIKE '%2018-12-07%' order by `id` asc
---
    public function getSalesCancelMount($date , $cond , $shop_id) {
        $bookings_deaprt = array();
        $bookings_return = array();
        $st = "9";//cancel status
        $price = 0;
        $statuses = [3,4,5,6]; //1未請求＝Unclaimed , 2請求中＝Claiming, 3カード＝Paid by credit card,4現金＝Paid by cash , 5振込＝Paid by cash (bank transfer), 6未払いで完了＝finished with unclaim
        $bookings = \DB::table('bookings')
                    ->where('status',$st);
        if($shop_id != 0)
            $bookings = $bookings->where('pickup_id','=', $shop_id);
        $bookings_depart    = $bookings->where('cancel_date','LIKE', '%'.$date.'%')->orderBy('id','asc')->get();;

select `bo`.*, `po`.`name` as `portal_name`, `u`.`first_name`, `u`.`last_name` from `bookings` as `bo` left join `portal_site` as `po` on `po`.`id` = `bo`.`portal_id` left join `users` as `u` on `bo`.`client_id` = `u`.`id` where `bo`.`status` in ('9') and `bo`.`cancel_status` in ('1', '2', '5') and `bo`.`pickup_id` = '4' and `bo`.`cancel_date` LIKE '%2018-12-07%' order by `id` asc
---
    public function getSalesCancellation($date , $cond , $shop_id) {
        $ret = array();
        $price = 0;
        $bo_status = array('9');
        $statuses = array('1','2','5'); //1未請求＝Unclaimed , 2請求中＝Claiming, 1カード＝Paid by credit card,2現金＝Paid by cash , 5振込＝Paid by cash (bank transfer), 6未払いで完了＝finished with unclaim
        $bookings = \DB::table('bookings as bo')
            ->leftjoin('portal_site as po', 'po.id','=','bo.portal_id')
            ->leftjoin('users as u', 'bo.client_id','=','u.id')
            ->whereIn('bo.status',$bo_status)
            ->whereIn('bo.cancel_status',$statuses);
            //->where('bo.cancel_total','>','0');
        if($shop_id != 0)
            $bookings   = $bookings->where('bo.pickup_id','=', $shop_id);
         $bookings       = $bookings->where('bo.cancel_date','LIKE', '%'.$date.'%')->orderBy('id','asc')
                                    ->select(['bo.*','po.name as portal_name','u.first_name','u.last_name'])->get();