hakoren/app/Http/Controllers/UserController.php

    public function index(Request $request)
    {

        $route = Route::getFacadeRoot()->current()->uri();
        $user = Auth::user();

        if ($user && $user->activated != 1) {
            return view('pages.user.unactive');
        }else {
            $adminlogin = $request->session()->get('adminlogin');
            $role = \DB::table('role_user as ru')->where('ru.user_id', $user->id)
                        ->leftJoin('roles AS r', 'r.id','=','ru.role_id')
                        ->select(['ru.*', 'r.level'])
                        ->first();
---
select `ru`.*, `r`.`level` from `role_user` as `ru` left join `roles` as `r` on `r`.`id` = `ru`.`role_id` where `ru`.`user_id` = '1' limit 1