<?php
return [
    'h1' => 'よくある質問',
    'l1' => '料金について',
    'l2' => '保険 / 補償制度について',
    'l3' => '車両 / オプションについて',
    'l4' => 'ご利用資格 (免許) について',
    'l5' => 'ご予約について',
    'l6' => '当日 / 受け渡し / 返却について',
    'l7' => 'ご利用中について',
    'l8' => '会員制について',
    'l9' => 'その他',
    'h2' => '保険 / 補償制度について',
    's1' => '免責料金とはどのようなものですか？',
    'p1' => '万一の事故の際に保険約款の免責事項に該当する事故でない限り、対物・車輌事故の免責金額をお客様にご負担していただきます。<br>
免責補償制度にご加入されますことによって、免責金額が免除されます。<br>詳しくは、<a href="{{URL::to(\'/\')}}/insurance">保険・補償・ワイド免責補償制度</a>をご覧ください。',
    's2' => '免責補償料金は、必ず支払わなければなりませんか？',
    'p2' => '免責補償は、お客様の任意でご加入していただけます。<br>
予約の際、もしくは契約の際に免責補償制度にご加入していただくと、万が一事故にあっても、以下のケースを除いて、対物、車両補償の免責額が免除されます。（規定のケースを除く）<br><br>
詳しくは、<a href="{{url("/insurance")}}">保険・補償・ワイド免責補償制度</a>をご覧ください',
    's3' => '免責補償に加入せず、事故に遭ってしまった場合はどうなりますか？',
    'p3' => '弊社のレンタカーには対人/無制限、対物/無制限、搭乗者/3,000万円、車両/時価額で全車補償しており、レンタル基本料金に含まれております。<br><br>
免責補償へ未加入の場合は、免責額部分をお客様にご負担していただきます。<br>
対物免責7万円 / 車両補償免責7万円<br>
また、ワイド免責補償へ未加入の場合は、ノンオペレーションチャージ（休業補償の一部）をご負担していただきます。<br>
予めご了承ください。<br><br>
万一の事故に備え、免責補償とワイド免責補償へのご加入をお勧めします。',
    's4' => '運転手が複数いるのですが、補償は全員に適用されますか？',
    'p4' => '貸渡の際に運転免許証をご提示いただいた方であれば、適用されます。',
    'bl' => 'ページトップへ',
];