<?php
return [
    'faq'       => 'よくある質問',
    'about'     => '料金について',
    'insurance' => '保険 / 補償制度について',
    'vehicle'   => '車両 / オプションについて',
    'license'   => 'ご利用資格 (免許) について',
    'reservation'=>'ご予約について',
    'delivery'  => '当日 / 受け渡し / 返却について',
    'aboutus'   => '利用中について',
    'membership'=> '会員制について',
    'other'     => 'その他',
    'whatinsurance'    => '免責補償とは何ですか？',
    'whatinsurance-a'   => '万一の事故の際にお客様のご負担となる、車両免責額（7万円）と対物免責額（7万円）を免除する任意加入の制度です。',
    'to-insurance'    => '詳しくは、保険・補償・ワイド免責補償制度をご覧ください。',
    'payment'   => '免責補償料金は、必ず支払わなければなりませんか？',
    'optional'       => '免責補償は、お客様の任意でご加入していただけます。<br>予約の際、もしくは契約の際に免責補償制度にご加入していただくと、万が一事故にあっても、以下のケースを除いて、対物、車両補償の免責額が免除されます。（規定のケースを除く）',
    'accident'=> '免責補償に加入せず、事故に遭ってしまった場合はどうなりますか？',
    'burden'     => '免責補償へ未加入の場合は、免責額部分をお客様にご負担していただきます。<br>対物補償：免責7万円 / 車両補償：補償免責7万円<br>                            また、ワイド免責補償へ未加入の場合は、ノンオペレーションチャージ（休業補償の一部）をご負担していただきます。<br>予めご了承ください。<br><br>万一の事故に備え、免責補償とワイド免責補償へのご加入をお勧めします。',
    'driver'      => '運転手が複数いるのですが、補償は全員に適用されますか？',
    'submit'    => '貸渡の際に運転免許証をご提示いただいた方であれば、適用されます。',
    'toppage'   => 'ページトップへ',   


];

