<?php
return [
    'faq'       => 'よくある質問',
    'about'     => '料金について',
    'insurance' => '保険 / 補償制度について',
    'vehicle'   => '車両 / オプションについて',
    'license'   => 'ご利用資格 (免許) について',
    'reservation'=>'ご予約について',
    'delivery'  => '当日 / 受け渡し / 返却について',
    'aboutus'   => '利用中について',
    'membership'=> '会員制について',
    'other'     => 'その他',
    'drivers-licence'    => '普通免許で運転できるのは、何人乗りまでですか？',
    'capacity'   => '普通免許で運転できるのは、定員10人の自動車までです。<br>マイクロバスは中型免許証、もしくは大型免許証が必要となります。<br><br>尚、国際免許の場合は運転可能範囲が異なります。',
    'police'    => '詳しくは、警視庁ホームページをご覧下さい。',
    'beginner'   => '初心者でも車は借りれますか？',
    'beginner-a'       => 'お貸出しをお断りさせていただく場合があります。<br>詳しくは、下記店舗にてご確認をお願いいたします。',
    'shop-fukuoka'    => '福岡空港店',
    'shop-okinawa'     => '那覇空港店',
    'international'      => '国際免許を持っていますが車は借りられますか？',
    'international-a'    => '可能です。<br>ただし、日本国内で運転が可能な免許証などをお持ちの方に限ります。',
    'agelimit'   => '車を借りるのに年齢制限はありますか？',
    'agelimit-a'  => '運転免許証をお持ちの方であれば、車を借りるのに年齢制限はございません。但し、免許取得後1年未満の方・21歳未満の方は、免責補償制度にご加入していただけません。下記店舗にてご確認をお願いいたします。',
    
    'toppage'   => 'ページトップへ',
];

