<?php
return [
    'faq'       => 'よくある質問',
    'about'     => '料金について',
    'insurance' => '保険 / 補償制度について',
    'vehicle'   => '車両 / オプションについて',
    'license'   => 'ご利用資格 (免許) について',
    'reservation'=>'ご予約について',
    'delivery'  => '当日 / 受け渡し / 返却について',
    'aboutus'   => '利用中について',
    'membership'=> '会員制について',
    'other'     => 'その他',
    'breakdown'    => '車が故障した時はどうしますか？',
    'breakdown-a'   => '車両故障や不具合が生じた場合は、出発店舗までご連絡をお願いいたします。',
   
	'accident'       => '事故を起こした時はどうしたらいいですか？',
	'accident-a'       => '万一、事故を起こされた場合には、速やかに下記の3つの処置をお願いいたします。<br>保険・補償の適用を行うための重要な手続きなどが含まれておりますので、必ず3つともお忘れなく行ってください。<br><br>①負傷者の救護<br>まず、負傷者の救護を行ってください。その後速やかにレンタカー車両を他の交通の邪魔にならない場所へ移動してください。<br><br>②警察への通報と届出<br>警察への届出義務は、加害者・被害者双方にあります。後日、事故証明書が必要となりますので、必要な手続きをしてください。<br><br>③ご出発店舗へご連絡<br>出発店舗へご連絡をお願いいたします。',
    'shop-fukuoka'    => '福岡空港店',
    'shop-okinawa'     => '那覇空港店',
    'extension'   => '利用時間(期間)は延長できますか？',
	'extension-a'   => '他のお客様のご予約状況によっては延長をお断りする場合もあります。<br>延長をご希望される場合はお早めに出発店舗までご連絡ください。<br>ご利用時間ご延長が可能な場合は、超過時間の時間料金をお支払いただきます。<br>なお、ご連絡なく超過した場合は、所定の別途違約料金を申し受けますのでご注意ください。',
    'ferry'  => 'フェリーで離島へ行きたいのですが？',
	'ferry-a'  => 'フェリーで離島へレンタカーを持ち出す事は禁止しております。あらかじめご了承ください。',
       
    'toppage'   => 'ページトップへ',
];

