<?php
return [
    'confirm'   => 'ご予約確定',
    'thank'     => 'ご予約ありがとうございました。',
    'confirmcar'=> 'お車のご予約が確定しました。',
    'short'     => ' <h2>配車時<span>20</span>分を短縮できます。</h2>',
    'nostart'   => '<h2><span>Quick</span>乗り出ししませんか?!</h2>',
    'gift1'      => 'ウェブで下記の内容をしていただくとさらに、お好きなドライブの友、<br>プレゼントを当日に鍵とご一緒にお渡しします。',
    'driverlicense'=>'運転免許証の確認',
    'contract'  => 'ご契約内容のご同意',
    'creditcard'=> 'クレジットカードでのお支払い',
    'extension' => 'Quick乗り出し手続きに進む',
    'refresh'   => 'ドライブのリフレッシュに...',
    'anytime'   => 'いつでもスーっとしたい時はこれっ！',
    'children'  => '大人も子ども好き...',
    'driving'   => 'ドライブ中の気分転換に常備しておきたい♪',
    'gift2'      => 'せっかくのドライブを楽しめるように ...ご乗車人数分（一回の服用分）プレゼント！',
    'confirmation'=> '※追加料金は一切発生しません。車のレンタル料金のみのお支払いと運転者の確認です。',
    'customer'  => '※免責補償を購入されていないお客様はお車の貸出し前に10分程度の車両点検をスタッフと一緒にお願いいたします。ご了承ください。',
    'toppage'   => 'ページトップへ',


];