<?php

return [
    'tryout'        => '試してみる',
    'whichshop'     => 'ご利用店舗はどちらですか？',
    'choosedate'    => 'あとは日付選択で',
    'clickbluebutton'     => '青ボタンクリック',
    'departure'     => '出発',
    'return'        => '返却',
    'searchcarrental'    => '驚きのレンタカー検索',
    'back'          => '戻る',
    'findcar'       => '車を探す',
    'optionnecessary'=> 'オプションは必要ですか?',
    'yes'           =>'はい',
    'noneedsearch'  =>'不要、すぐ検索',
    'selectoption'  =>'オプションを 選択して下さい。',
    'popularcar'    =>'人気車続々！365日格安！',
    'familytrip'    => '家族旅行',
    '1n2d'          => '1泊2日',
    'perday'        => '1日あたり',
    'requirerental'        => 'このクラスは福岡店のみです。',
    '70car'         => 'ヴォクシー70系 / ノア70系 / セレナ25系',
    '7-8pepoleride' => '7-8人乗り',
    '70cardesc'     => 'グループ旅行の定番。初心者でも運伝しやすく車内も広いので初めての旅行先にお勧めです。',
    'viewdetail'    => '詳細を見る',
    'whichstore'    => 'どちらの店舗をご利用ですか？',
    'closeup'       => '閉じる',
    'yen'           => '‎円',
    'reception'     => '接待',
    'golf'          => '・ゴルフ',
    '30car'         => 'ヴェルファイア30系 /アルファード30系',
    '7seat'         => '7人乗り',
    '30cardesc'     => '接待の送迎やゴルフの送迎に。同乗者に喜ばれるゆったりとした空間。',
    'manypepole'    => '大人数',
    '200car'        => 'ハイエースグランドキャビン200系/キャラバンNV350',
    '10seat'        => '10人乗り',
    '200cardesc'    => '大人数の旅行にお勧めです。荷物もしっかり入る、広々室内。',
    'circle'        => 'サークル',
    'competition'   => 'コンペ',
    'coastercar'    => 'コースター/リエッセ',
    '26-29seat'     => '26-29人乗り',
    'coasterdesc'   => '団体旅行の定番のマイクロバス。室内ＴＶ・バックモニタ付なので安心。上記画像は代表車種となります。',
    'mbclass'      => '※このクラスのレンタルはお問合せ下さい。',
    'fukuairport'  => '福岡空港店',
    'okinaairport' => '那覇空港店',
    'watchlinup'    => 'LINEUPを見る',
    'hakoredesc1'   => 'ハコレンタカーは西日本で最大級のワンボックス専門店として営業しています。',
    'hakoredesc2'   => '車種ラインナップをコンパクトワゴン以上と限定する事で、内部業務を効率化させ、その分価格還元として大手のレンタカー会社様よりも安い価格設定でご提供できています。',
    'hakopoint'     => '失敗しないレンタカー選びのPOINT!',
    'tripdesc'      =>'<b>移動時間は旅行全体の1/3</b>もあると言われるのをご存知でしょうか？
                        <br>旅行プランを考える時に軽視されやすいのが移動です。
                        <br>ハコレンタカーは4~5人でのご旅行に、<b>7~8人乗りの車</b>をオススメしております！
                        <br><br>そうすると「価格も上がってしまうのでは？」
                        <br>ハコレンタカーは旅の質が上がる車を「<b>価格帯が変わらずに</b>」 ご提供しております。',
   'tripdesc1'      => '高い天井で、車内空間が広い！
                        <br>後部シートがスライドしたり倒せたり便利！
                        <br>荷物がタップリ積めて、お土産などが増えても問題ない！
                        <br><br>そうすると移動も快適になり、旅行そのものの質が上がります。
                        <br>4~5人乗りの車よりも<b>ワンボックスカーが断然快適</b>です。<br>',
    'tripdesc2'     => '子供連れの旅行は何かと大変で。
                        <br>でも、コンパクトワゴンだと荷物もたくさん乗せられて
                        <br>子供のお昼寝もシートを倒してゆっくり過ごせたわ。
                        <br>ストレスが減ると、疲れも減るのね！',
    'tripdesc3'     => '以前、他で借りた車よりゴルフバックが楽々積めたよ。
                        <br>天井高の広い車内で快適に過ごして貰えたし、接待ゴルフには最適だね！',
    'tripdesc4'     => '<h2>比べれば圧倒的<br/>最安値級 7~8人乗りワゴン車!!</h2>
                        <p class="h-txt">1泊2日の1日当たりの料金を比較してみたら、こんなに差が出ました！ </p>
                        <p class="h-txt">福岡空港・那覇空港の周辺のレンタカー大手3社と料金比較をすると、同クラスの車両で、なんと1万2000円近くも料金差が！<br>専門店だからこそできる圧倒的低価格のハコレタカー。さて、浮いたお金で楽しもう♪</p>',
    'tripdesc5'     => '<h2>業界初!!<br/>徹底除菌車をお出し致します!!</h2>
                        <p class="h-txt">車の見た目が綺麗、車内が清掃されている、こんなことは当たり前！</p>
                        <p class="h-txt">移動空間を一層快適にお過ごしいただくため、ハコレンタカーでは車内の衛生管理を徹底しています。医療現場や飲食店で使用されている高純度エタノールなので小さなお子様やアレルギーをお持ちの方も安心してご利用いただけます。
                        </p>',
    'roadservice'   => '<span>安心の</span><br>ロードサービス',
    '24support'     => '24時間 安心のサポートを。',
    'trouble'       => 'タイヤトラブル',
    'titer'         => 'バッテリー上がり',
    'key'           => '鍵の閉じ込め',
    'tripdesc6'     => '慣れない場所でのトラブルは、とても不安になります。
                        <br>そんな状況を素早く解決！
                        <br>電話一本で提携スタッフが駆けつけるロードサービスをご用意しております。
                        <br>タイヤの脱輪や、バッテリートラブル、ガス欠、鍵の閉じ込め、など迅速対応！ 
                        <br>万一に備えたロードサービスは追加料金ナシでご利用頂けます！',
    'fuku'          => '福岡',
    'okina'         => '沖縄',
    'in'            => 'で最大級',
    'of'            => 'の',
    'onebox'        => 'ワンボックス専門',
    'hako'          => 'ハコレンタカー',
    'cheap'         => '格安・保険込み・清潔・丁寧で親身対応',
    'nicerent'      => 'あなたの「いいね」を是非ハコレンタカーに！',
    'feedback'      => 'フィードバックには真摯に対応し、サービスの質の改善を続けます。',
    'notice'        => 'お知らせ',
    'notfound'      => 'ニュースが見つかりません',
    'viewlist'      => '一覧を見る',
    'faq'           => 'よくある質問',
    'cancelbook'    => '予約の変更・キャンセルはどうすれば良いですか？',
    'book'          => '予約はいつまでにすればいいですか？',
    'dependtime'    => '地域や時期によって料金は変わりますか？',
    'fee'           => '免責料金とは何ですか？',
    'compansation'  => '運転手が複数いるのですが、補償は全員に適用されますか？',
    'news'  => 'お知らせ',



];
