hakoren/app/Exceptions/Handler.php

select * from `users` where `signin_ip` = '0.0.0.0' limit 1
select `r`.* from `roles` as `r` left join `role_user` as `ru` on `ru`.`role_id` = `r`.`id` where `ru`.`user_id` = '1' limit 1
---
    protected function unauthenticated($request, AuthenticationException $exception)
    {
        // session aaaaaaa
        if ($request->expectsJson()) {
            return response()->json(['error' => 'Unauthenticated.'], 401);
        }
        $ipAddress  = new CaptureIpTrait;
        $ipaddress  = $ipAddress->getClientIp();
        $user = User::where('signin_ip', $ipaddress)->first();
        $admin = 'false';
        if(!empty($user)){
            $user_id = $user->id;
            $role = \DB::table('roles as r')
                ->leftjoin('role_user as ru', 'ru.role_id','=','r.id')
                ->where('ru.user_id',$user_id)->select('r.*')->first();