<!-- Modal -->
<div class="modal fade" id="myModal" role="dialog">
  <div class="modal-dialog modal-lg">
    <div class="modal-content">
      <div class="modal-header">
        <h4 class="modal-title">会員規約</h4>
        <button type="button" class="close" data-dismiss="modal">&times;</button>

      </div>
      <div class="modal-body policy-modal">
        <p class="policy-f-ttl">ご入会にあたって</p>
        <ol class="li-disc">
          <li>下記会員規約をお読みいただき、ご同意のうえお申し込みくださいますようお願いいたします。</li>
          <li>ご不明な点はハコレンタカーWEBサイトのお問合わフォームよりご連絡ください。</li>
		</ol>
        <p class="policy-f-ttl">会員規約</p>
        <p class="policy-ttl">入会</p>
        <ol class="li-num">
          <li>申込者は、当規約に同意の上、入会を申し込みます。</li>
          <li>ハコレンタカー（以下、当社）が所定の審査を行い入会を承認した個人をハコレンタカー会員（以下、会員）とします。</li>
		</ol>
        <p class="policy-ttl">確約事項</p>
        <ol>
          <li>会員は、暴力団、暴力団関係団体、その他、暴力、威力と詐欺的手法を駆使して経済的利益を追求する集団（以下「反社会的勢力」といいます。）に属する者ではないこと及び反社会的勢力を利用する者ではないことを誓約し、かつ将来にわたり確約します。</li>
		</ol>
		
        <p class="policy-ttl">届け出事項の変更</p>
        <ol class="li-num">
          <li>会員は、当社に対して届け出た氏名・住所・電話番号・免許証記載内容等に変更が出た場合、ただちに所定の手続きによる届け出を行うものとします。</li>
          <li>前項の届け出が行われなかったり、届け出に不備があったために、当社からの通知又は送付書類その他のものが延着し、又は到着しなかった場合には通常到着すべき時に会員に到着したものとみなします。その際、会員の不利益が生じた場合も当社は一切の責任を負いません。</li>
		</ol>
		
        <p class="policy-ttl">退会</p>
        <ol class="li-num">
          <li>会員は退会する場合、所定の退会手続きを行う事とします。なお、当社に対する未払債務がある場合には、会員は当社に対し退会時までに全額支払うものとします。</li>
          <li>当社が会員として不適当と認めた場合、当社は何らの通知・催告を要せずして、会員資格を取り消すことができます。
			<ol class="sub-li">
			  <li>虚偽の申告をした場合。</li>
			  <li>会員の信用状態に重大な変化が生じた場合。</li>
			  <li>会員が本規約や貸渡約款に違反した場合。</li>
			</ol>
		  </li>
		</ol>
        <p class="policy-ttl">サービスプログラムの提供</p>
        <ol class="li-num">
          <li>会員は、全国のハコレンタカーにおいて、当社が定めるサービスを受けることができます。</li>
          <li>レンタカーの貸渡し等に関する一切は、貸渡約款に基づきます。<br>
当社は予告なしにいつでも提供するサービスを終了もしくは中止し、又は内容を変更することができるものとします。</li>
		</ol>
        <p class="policy-ttl">個人情報の利用</p>
        <ol class="li-num">
          <li>会員は、当社が、入会申込書に記載された情報（変更の届け出があった場合にはその内容）を次の目的で利用することについて同意するものとします。
		  
			<ol class="sub-li">
			  <li> レンタカーの事業許可を受けた事業者として、貸渡契約締結時に貸渡証を作成するなど、事業許可の条件として義務付けられている事項を遂行するため。</li>
			  <li>借受人又は運転者に、レンタカー及びこれらに関連したサービスの提供をするため。</li>
			  <li>借受人又は運転者の本人確認及び審査をするため。</li>
			  <li>レンタカー、その他当社において取り扱う商品・サービス等の提供、並びに各種イベント・キャンペーン等の開催について、宣伝印刷物の送付、eメールの送信等の方法により、借受人又は運転者にご案内するため。</li>
			  <li>当社の取り扱う商品・サービスの企画開発、又はお客さま満足度向上策の検討のため、借受人又は運転者にアンケート調査を実施するため。</li>
			  <li>個人情報を統計的に集計・分析し、個人を識別・特定できない形態に加工した統計データを作成するため。</li>
			</ol>
		  </li>
          <li>当社は、前項(4)のご案内を会員に対して行うことがあります。<br>
当社は、会員に提供するインターネットサービス（ホームページやモバイルサイト）に関し、ログに記録された会員のＩＰアドレスを、主として下記の目的で利用します。
			
			<ol class="sub-li">
			  <li>サーバーで発生した問題等の原因究明及び解決のため。</li>
			  <li>サイトの管理のため。</li>
			</ol>
		  </li>
          <li>当社は当社の当社ホームページにおいて、主として下記の目的でクッキーを使用することがあります。
				
			<ol class="sub-li">
			  <li>会員が会員サービス等を利用される際、毎回パスワードを入力しなくてもすむようにするため。</li>
			  <li>会員に、よりご満足いただけるようホームページやeメールなどの内容を改良したり、個々の会員に合わせてカスタマイズしたりするため。</li>
			  <li>会員に有益と思われる情報をお見せするよう調節したりするため。</li>
			  <li>会員に適切な広告を配信するため。</li>
			</ol>
		  </li>
		  <li>会員は、お使いのブラウザの設定により、クッキーの受け取りを拒否したり、クッキーを受け取ったとき警告を表示させたりできます。当社ホームページの各サイトのサービスには、クッキーなしではサービス内容に制限が発生したり利用できない場合もあります。<br>
広告配信等に利用するため、当社は広告配信サービスを提供する事業者に対して、個人を特定できない状態で会員の属性情報等を提供することがあります。<br>
提供を行う場合、情報の項目は「予約時のメールアドレスを暗号化し、復元できない形式に加工した文字列」、「性別」、「生年」、「ご利用車種クラス」、「会員種別」とします。これらの情報は安全なサーバを介して事業者に提供されます。<br>
個人情報取り扱いの詳細については、当社ホームページ上の個人情報保護方針（プライバシーポリシー）をご参照ください。
		  </li>
		</ol>
        <p class="policy-ttl">規約の変更</p>
        <ol class="li-num">
          <li>本規約は予告なく改定する場合があります。</li>
          <li>本規約が改定された場合は、ホームページにて会員に通知することとし、通知の後に当社のサービスを使用したときは、会員は変更に了承されたものとします。
平成30年5月10日</li>
		</ol>
        <p class="policy-f-ttl" style="margin-top:40px;">キャンセルポリシーについて</p>
		
		<p>お客様都合により予約を取消される場合は、弊社規定の予約取消手数料(キャンセル料)を申し受けます。あらかじめご了承下さい。</p>
		<table class="table" style="max-width:250px; margin-left:20px;">
			<tr>
				<td>当日</td>
				<td>基本料金の100%</td>
			</tr>
			<tr>
				<td>1日前まで</td>
				<td>基本料金の80%</td>
			</tr>
			<tr>
				<td>4日前まで</td>
				<td>基本料金の50%</td>
			</tr>
			<tr>
				<td>9日前まで</td>
				<td>基本料金の30%</td>
			</tr>
			<tr>
				<td>15日前まで</td>
				<td>基本料金の20%</td>
			</tr>
			<tr>
				<td>上記指定日以前</td>
				<td>なし</td>
			</tr>
		</table>
		
        <p class="policy-f-ttl" style="margin-top:40px;">ご予約の確認メールに関して</p>
		<p>ご予約の確認メールがお客様のメールアドレスに届いていないもの、またはハコレンのシステムに登録されていないご予約は、有効な予約とはなりませんので、予めご了承ください。<br>予約を取ったのに、確認メールが届いていないお客様はハコレンサポートセンターまでお電話ください。</p>
		<p>お申込み前に必ずご確認下さいますようお願い致します。</p>
        
        
      </div>
      <div class="modal-footer">
        <button type="button" class="btn btn-default" data-dismiss="modal">閉じる</button>
      </div>
    </div>
  </div>
</div>
<!-- Modal -->
