hakoren/app/Http/Controllers/Front/SearchController.php

        }
        $car_category   = $request->input('car_category', '');
        if($car_category == '') {
            $category = \DB::table('car_type_category')->where('name', '乗用車')->first();
---
select * from `car_type_category` where `name` = '乗用車' limit 1

        if($pickup != '') $free_options[] = $pickup;
        $search_condition = '';

        $shops      = Shop::all();
        $categorys  = \DB::table('car_type_category')->get();
---
select * from `car_shop`
select * from `car_type_category`

        $depart_shop_name = '';
        $depart_shop_name_en = '';
        if($depart_shop != ''){
            $shop1 = \DB::table('car_shop')->where('id','=', $depart_shop)->first();
---
select * from `car_shop` where `id` = '4' limit 1

        $search->rentdates = $day;

        // search start
        $allClasses = \DB::table('car_class as c')
            ->join('car_class_price as p', 'c.id', '=', 'p.class_id')
            ->select(['c.*', 'p.n1d2_day1 as price'])
            ->where('c.car_shop_name', $depart_shop)
            ->where('c.status', 1)
            ->where('c.static_flag', 0)
            ->orderBy('c.car_class_priority')->get();
---
select `c`.*, `p`.`n1d2_day1` as `price` from `car_class` as `c` inner join `car_class_price` as `p` on `c`.`id` = `p`.`class_id` where `c`.`car_shop_name` = '4' and `c`.`status` = '1' and `c`.`static_flag` = '0' order by `c`.`car_class_priority` asc

        foreach($allClasses as $cls){

            if($passenger != 'all') {
                $psgRanges = \DB::table('car_class_passenger AS p')
                    ->leftJoin('car_passenger_tags AS t', 'p.passenger_tag', '=','t.id')
                    ->where('p.class_id','=',$cls->id)
                    ->where('t.min_passenger','<=',$passenger)
                    ->where('t.max_passenger','>=',$passenger)
                    ->orderBy('t.show_order')
                    ->count();
---
select count(*) as aggregate from `car_class_passenger` as `p` left join `car_passenger_tags` as `t` on `p`.`passenger_tag` = `t`.`id` where `p`.`class_id` = '3' and `t`.`min_passenger` <= '4' and `t`.`max_passenger` >= '4'

            }

            if( !empty( $options )) {
                $class_options = \DB::table('car_option_class')->where('class_id',$cls->id )->get();
---
select * from `car_option_class` where `class_id` = '3'

            }

            // get class insurance
            $cis = \DB::table('car_class_insurance')->where('class_id',$cls->id)->orderby('insurance_id','asc')->get();
---
select * from `car_class_insurance` where `class_id` = '3' order by `insurance_id` asc

//                ->where('p.class_id','=', $cls->id)
//                ->orderBy('t.show_order')
//                ->get();
            $thumbnails = \DB::table('car_class_thumb')
                ->where('class_id', $cls->id)->get();
---
select * from `car_class_thumb` where `class_id` = '3'

        }

        // get passenger tags from car_passenger_tags
        $passengerTags = CarPassengerTags::orderBy('show_order')->get();

        $static_classes = [];
        if($depart_shop == 4){
            $static_classes = \DB::table('car_class')
                ->where('car_shop_name', $depart_shop)
                ->where('static_flag', 1)
                ->orderBy('car_class_priority')->get();
            foreach($static_classes as $cls) {
                $models = \DB::table('car_class_model as cm')
                    ->leftJoin('car_model as m', 'cm.model_id', 'm.id')
                    ->where('class_id', $cls->id)
                    ->orderBy('cm.priority')
                    ->get();
---
select * from `car_passenger_tags` order by `show_order` asc
select * from `car_class` where `car_shop_name` = '4' and `static_flag` = '1' order by `car_class_priority` asc
select * from `car_class_model` as `cm` left join `car_model` as `m` on `cm`.`model_id` = `m`.`id` where `class_id` = '32' order by `cm`.`priority` asc

                }
                $cls->model_names = implode(', ', $tmp);

                $passengerTag = \DB::table('car_class as c')
                    ->leftJoin('car_class_passenger as p', 'c.id', '=', 'p.class_id')
                    ->leftJoin('car_passenger_tags as t', 'p.passenger_tag', '=', 't.id')
                    ->where('c.id', $cls->id)
                    ->orderby('t.show_order', 'desc')
                    ->first();
                $cls->minPsg = is_null($passengerTag)? 0 : $passengerTag->min_passenger;
                $cls->maxPsg = is_null($passengerTag)? 0 : $passengerTag->max_passenger;

                $options = \DB::table('car_option_class as c')
                    ->leftJoin('car_option as o', 'c.option_id', '=', 'o.id')
                    ->where('c.class_id', $cls->id)
                    ->orderby('o.order')
                    ->get();
---
select * from `car_class` as `c` left join `car_class_passenger` as `p` on `c`.`id` = `p`.`class_id` left join `car_passenger_tags` as `t` on `p`.`passenger_tag` = `t`.`id` where `c`.`id` = '32' order by `t`.`show_order` desc limit 1
select * from `car_option_class` as `c` left join `car_option` as `o` on `c`.`option_id` = `o`.`id` where `c`.`class_id` = '32' order by `o`.`order` asc

            }
        }

        $free_options = \DB::table('car_option as o')
            ->leftJoin('car_option_shop as s', 'o.id', '=', 's.option_id')
            ->where('s.shop_id', $depart_shop)
            ->where('o.type', 1)
            ->select('o.*')
            ->orderby('o.order', 'asc')
            ->get();

        $paid_options = \DB::table('car_option as o')
            ->leftJoin('car_option_shop as s', 'o.id', '=', 's.option_id')
            ->where('s.shop_id', $depart_shop)
            ->where('o.type', 0)
            ->where('o.google_column_number', '<', 200)
            ->select('o.*')
            ->orderby('o.order', 'asc')
            ->get();
---
select `o`.* from `car_option` as `o` left join `car_option_shop` as `s` on `o`.`id` = `s`.`option_id` where `s`.`shop_id` = '4' and `o`.`type` = '1' order by `o`.`order` asc
select `o`.* from `car_option` as `o` left join `car_option_shop` as `s` on `o`.`id` = `s`.`option_id` where `s`.`shop_id` = '4' and `o`.`type` = '0' and `o`.`google_column_number` < '200' order by `o`.`order` asc

            'request_page'  => $request_page
        ];

		$meta_info = Page::where('title','空車検索')->first();
---
select * from `pages` where `title` = '空車検索' limit 1

    public function search_confirm(Request $request)
    {
		$no_sp_tel_icon = 1;
        $inputs    = $request->all();
        $class_id = $request->get('data_class_id');
        $models = \DB::table('car_class_model as cm')
            ->leftJoin('car_model as m', 'cm.model_id', '=', 'm.id')
            ->where('cm.class_id', $class_id)
            ->select('m.*', 'cm.class_id')
            ->get();
        foreach ($models as $model) {
            $category = \DB::table('car_type_category')->where('id', $model->category_id)->orderby('id','desc')->first();
            $model->category_name = !empty($category)? $category->name : '';
            $type = \DB::table('car_type')->where('id', $model->type_id)->orderby('id','desc')->first();
            if(empty($type))
                $model->type_name = "";
            else
                $model->type_name = $type->name;
            $vendor = \DB::table('car_vendor')->where('id', $model->vendor_id)->orderby('id','desc')->first();
---
select `m`.*, `cm`.`class_id` from `car_class_model` as `cm` left join `car_model` as `m` on `cm`.`model_id` = `m`.`id` where `cm`.`class_id` = '14'
select * from `car_type_category` where `id` = '1' order by `id` desc limit 1
select * from `car_type` where `id` = '9' order by `id` desc limit 1
select * from `car_vendor` where `id` = '1' order by `id` desc limit 1

			}
        }
        // get max capacity of class
        $max_capacity = \DB::table('car_class_passenger AS p')
            ->leftJoin('car_passenger_tags AS t', 'p.passenger_tag','=','t.id')
            ->select('t.name','t.name_en')
            ->where('p.class_id', '=', $class_id)
            ->orderBy('t.show_order','DESC')
            ->first();
---
select `t`.`name`, `t`.`name_en` from `car_class_passenger` as `p` left join `car_passenger_tags` as `t` on `p`.`passenger_tag` = `t`.`id` where `p`.`class_id` = '14' order by `t`.`show_order` desc limit 1

        $optionids  = explode("," ,$request->get('data_option_ids'));
        if(!empty($optionids)) {
            foreach ($optionids as $id) {
                $option = \DB::table('car_option')
                    ->where('id', $id)->first();
---
select * from `car_option` where `id` = '10' limit 1

    private function get_campaigns($region_code,$start,$end, $max_num, $page = 1) {

//        $start = date('Y-m-d',strtotime('today'));
//        $end = date('Y-m-d',strtotime('today +15 days'));
        $start = date('Y-m-d',strtotime($start.' -1 day'));
        $end = date('Y-m-d',strtotime($end.' +1 day'));
        $date_array = [];
        for($k = 0; $k < 16; $k++) {
            $date_array[] = date('Y-m-d', strtotime($start.' +'.$k.' days'));
        }

        if($region_code == 'all') {
            $shops = Shop::all();
---
select * from `car_shop`

                $tmp['class_name']      = $car->class_name;
                $tmp['max_passenger']   = $car->max_passenger;
                if($oldClassID !== $car->class_id) {
                    $paids = \DB::table('car_option_class as oc')
                        ->leftjoin('car_option as o', 'oc.option_id', '=', 'o.id')
                        ->where('oc.class_id', $car->class_id)
                        ->where('o.type', 0)
                        ->where('o.google_column_number', '<', 200)
                        ->where('o.delete_flag', 0)
                        ->get();
                    $frees = \DB::table('car_option_shop as os')
                        ->leftjoin('car_option as o', 'os.option_id','=','o.id')
                        ->where('os.shop_id', $shop->id)
                        ->where('o.type', 1)
                        ->where('o.delete_flag', 0)
                        ->get();
---
select * from `car_option_class` as `oc` left join `car_option` as `o` on `oc`.`option_id` = `o`.`id` where `oc`.`class_id` = '3' and `o`.`type` = '0' and `o`.`google_column_number` < '200' and `o`.`delete_flag` = '0'
select * from `car_option_shop` as `os` left join `car_option` as `o` on `os`.`option_id` = `o`.`id` where `os`.`shop_id` = '4' and `o`.`type` = '1' and `o`.`delete_flag` = '0'

    public function showToppage() {
//        echo ServerPath::countBookingsIncludeDate(16, '2018-07-15');
//        echo ServerPath::countInspectionsIncludeDate(16, '2018-07-15'); return;
        $categorys  = \DB::table('car_type_category')->get();
        $shops      = Shop::all();
		$caroptions = CarOption::where('type','0')->get();

        $blogposts  = BlogPost::orderBy('publish_date','desc')
                                ->take(5)
                                ->get();
		$lineup_ids = [3,49,6,51,10,54,32];
		$lineups = \DB::table('car_class')
                    ->leftJoin('car_shop as cs', 'car_class.car_shop_name','=','cs.id')
                    ->leftJoin('car_class_price as ccp', 'car_class.id','=','ccp.class_id')
                    ->select('car_class.*','cs.name as csname','cs.name_en as csname_en','cs.id as cs_id','ccp.n1d2_day1')
                    ->whereIn('car_class.id',$lineup_ids)
                    ->get();
---
select * from `car_type_category`
select * from `car_shop`
select * from `car_option` where `type` = '0'
select * from `blog_posts` order by `publish_date` desc limit 5
select `car_class`.*, `cs`.`name` as `csname`, `cs`.`name_en` as `csname_en`, `cs`.`id` as `cs_id`, `ccp`.`n1d2_day1` from `car_class` left join `car_shop` as `cs` on `car_class`.`car_shop_name` = `cs`.`id` left join `car_class_price` as `ccp` on `car_class`.`id` = `ccp`.`class_id` where `car_class`.`id` in ('3', '49', '6', '51', '10', '54', '32')

        $hours = $this->hours;
//        var_dump($campaigns); return;

		$meta_info = Page::where('title','トップページ')->first();
---
select * from `pages` where `title` = 'トップページ' limit 1

    public function getShopOptions(Request $request) {
        $user = Auth::user();
        $level = '0' ;
        $level_flag = 'false';
        if(!empty($user)) {
            $id = $user->id;
            $da = \DB::table('role_user as ru')
                ->leftjoin('roles as r', 'r.id','=','ru.role_id')
                ->where('ru.user_id',$id)->select(['r.level'])->first();
            $level = $da->level;
        }
        if($level == '5' || $level == '4') {//admin , subadmin
            $level_flag = 'true';
        }
        $dropoff_id = $request->get('shop_id');
        $paid_options = \DB::table('car_option as o')
            ->leftJoin('car_option_shop as s', 'o.id', '=', 's.option_id')
            ->select(['o.*', 's.shop_id'])
            ->where('s.shop_id', $dropoff_id);
            if($level_flag == 'false') {
                $paid_options = $paid_options->where('o.google_column_number','<' ,200) ;
            };
        $paid_options = $paid_options
            ->where('o.type', 0) // 0: paid options, 1: free options
            ->orderby('order', 'asc')
            ->get();

        $free_options = \DB::table('car_option as o')
            ->leftJoin('car_option_shop as s', 'o.id', '=', 's.option_id')
            ->select(['o.*', 's.shop_id'])
            ->where('s.shop_id', $dropoff_id)
            ->where('o.type', 1) // 0: paid options, 1: free options
            ->orderby('order', 'asc')
            ->get();
---
select `r`.`level` from `role_user` as `ru` left join `roles` as `r` on `r`.`id` = `ru`.`role_id` where `ru`.`user_id` = '1' limit 1
select * from `users` where `id` = '1' limit 1
select `o`.*, `s`.`shop_id` from `car_option` as `o` left join `car_option_shop` as `s` on `o`.`id` = `s`.`option_id` where `s`.`shop_id` = '4' and `o`.`google_column_number` < '200' and `o`.`type` = '0' order by `order` asc
select `o`.*, `s`.`shop_id` from `car_option` as `o` left join `car_option_shop` as `s` on `o`.`id` = `s`.`option_id` where `s`.`shop_id` = '4' and `o`.`type` = '1' order by `order` asc

    public function getOptionsFromClass($class_id , $select_options){
        $add_opions = array();
        if(empty($select_options)) {
            $ops = \DB::table('car_option as co')
                ->join('car_option_class as coc', 'coc.option_id', '=', 'co.id')
                ->where('coc.class_id', $class_id)
                ->select(['co.*'])->get();
            foreach ($ops as $op) {
                array_push($add_opions, $op);
            }
        } else {
            foreach ($select_options as $opt_id) {
                $op = \DB::table('car_option as co')
                    ->join('car_option_class as coc', 'coc.option_id', '=', 'co.id')
                    ->where('coc.class_id', $class_id)
                    ->where('co.id', $opt_id)
                    ->select(['co.*'])->first();
---
select `co`.* from `car_option` as `co` inner join `car_option_class` as `coc` on `coc`.`option_id` = `co`.`id` where `coc`.`class_id` = '3'
select `co`.* from `car_option` as `co` inner join `car_option_class` as `coc` on `coc`.`option_id` = `co`.`id` where `coc`.`class_id` = '3' and `co`.`id` = '10' limit 1

    public function getShopName($shop_id){
        $shop = \DB::table('car_shop')->where('id', $shop_id)->first();
---
select * from `car_shop` where `id` = '4' limit 1

    public function getShopName_en($shop_id){
        $shop = \DB::table('car_shop')->where('id', $shop_id)->first();
---
select * from `car_shop` where `id` = '4' limit 1

    public function getCategoryName($category_id){
        $category = \DB::table('car_type_category')
            ->where('id',$category_id)
            ->select(['*'])->first();
---
select * from `car_type_category` where `id` = '1' limit 1

    public function getCategoryName_en($category_id){
        $category = \DB::table('car_type_category')
            ->where('id',$category_id)
            ->select(['*'])->first();
---
select * from `car_type_category` where `id` = '1' limit 1

    public function classlist(){
        $class = CarClass::orderby('car_class_priority')->get();
        $count = 0;
        foreach ($class as $cl) {
            $class_id = $cl->id;
            $models = \DB::table('car_model as cm')
                ->leftjoin('car_class_model as ccm','ccm.model_id','=', 'cm.id')
                ->where('ccm.class_id',$class_id)
                ->select(['cm.id', 'cm.thumb_path'])->orderby('ccm.priority','asc')->get();
---
select * from `car_class` order by `car_class_priority` asc
select `cm`.`id`, `cm`.`thumb_path` from `car_model` as `cm` left join `car_class_model` as `ccm` on `ccm`.`model_id` = `cm`.`id` where `ccm`.`class_id` = '67' order by `ccm`.`priority` asc